// Напишите програму приветствия пользователя

Console.WriteLine("Введите Ваше имя");
string username = Console.ReadLine() ??"";
Console.WriteLine("Привет, ");
Console.WriteLine(username);