// Напишите программу, которая будет выводить на косоль результат деления двух чисел

double numberA = 12;
double numberB = 5;
Console.WriteLine(numberA / numberB);