/*
Напишите программу, которая из имеющегося массива строк, выводит массив строк с менее или равна 3 символам.
Первоначальный массив можно задать на старте выполнения алгоритма или ввести с консоли. Лучше обойтись исключительно массивами без использования коллекций.
*/

Console.WriteLine("Введите три массива строк");
string ArrayStr = Console.ReadLine();
string[] array = ArrayStr;


